package czb.train.attributeExtrator;

import czb.dataStructure.Table;
import czb.tools.filereader.TxtFileReader;
import czb.train.weka.Csv2Arff;
import utils.CommonTools;

import java.io.IOException;
import java.lang.reflect.Field;
import java.util.*;

/**
 * Created by E440 on 16-8-15.
 */
public class Preprocess {

    private Tfidf tfidf = new Tfidf();

    private String charset = "utf-8";

    private List<String> locations  = Arrays.asList("北京","天津","河北","山西","内蒙","辽宁","吉林","黑龙江","上海","江苏","浙江","安徽","福建","江西","山东","河南","湖北","湖南","广东","广西","海南","重庆","四川","贵州","云南","西藏","陕西","甘肃","青海","宁夏","新疆","台湾","香港","澳门","北京市","东城区","西城区","崇文区","宣武区","朝阳区","海淀区","丰台区","通州区","顺义区","房山区","石景山区","门头沟区","大兴","昌平","延庆","怀柔","密云","平谷","天津市","和平区","河东区","南开区","河西区","河北区","红桥区","塘沽区","汉沽区","大港区","东丽区","西青区","津南区","北辰区","武清","宝坻","蓟县","静海","宁河","河北省","石家庄","邢台","邯郸","衡水","沧州","保定","廊坊","张家口","承德","唐山","秦皇岛","鹿泉","沙河","武安","南宫","冀州","藁城","晋州","辛集","深州","泊头","黄骅","新乐","安国","定州","河间","任丘","高碑店","涿州","霸州","遵化","丰南","迁安","三河","井陉","元氏","赞皇","高邑","临城","内丘","邢台","永年","涉县","磁县","临漳","魏县","大名","邯郸","成安","肥乡","广平","馆陶","曲周","邱县","临西","南和","鸡泽","威县","任县","巨鹿","平乡","广宗","清河","故城","隆尧","柏乡","枣强","新河","宁晋","赵县","栾城","平山","灵寿","行唐","曲阳","唐县","望都","顺平","满城","阜平","易县","涞水","涞源","定兴","正定","无极","深泽","安平","饶阳","武强","武邑","献县","阜城","景县","吴桥","东光","南皮","沧县","盐山","海兴","青县","博野","蠡县","肃宁","清苑","高阳","大城","文安","安新","徐水","容城","雄县","永清","固安","蔚县","阳原","涿鹿","怀来","宣化","怀安","万全","尚义","崇礼","张北","康保","沽源","赤城","隆化","滦平","承德","平泉","兴隆","迁西","玉田","丰润","卢龙","抚宁","滦县","昌黎","滦南","乐亭","唐海","香河","孟村回族自治县","青龙满族自治县","围场满族蒙古族自治县","宽城满族自治县","丰宁满族自治县","大厂回族自治县","山西省","太原","阳泉","朔州","大同","长治","晋城","古交","忻州","原平","榆次","介休","孝义","汾阳","离石","霍州","临汾","侯马","河津","运城","永济","潞城","高平","阳曲","定襄","五台","代县","繁峙","灵丘","宁武","神池","山阴","应县","浑源","广灵","怀仁","大同","阳高","天镇","左云","右玉","偏关","河曲","保德","五寨","岢岚","兴县","岚县","静乐","娄烦","方山","临县","清徐","交城","文水","柳林","中阳","交口","石楼","灵石","汾西","洪洞","隰县","永和","大宁","蒲县","吉县","乡宁","襄汾","曲沃","新绛","稷山","绛县","垣曲","闻喜","夏县","平陆","万荣","临猗","芮城","盂县","寿阳","平定","昔阳","和顺","左权","榆社","沁县","襄垣","武乡","太谷","祁县","平遥","沁源","古县","安泽","浮山","翼城","沁水","阳城","黎城","屯留","长子","壶关","长治","平顺","陵川","泽州","内蒙古自治区","呼和浩特包头","乌海","赤峰","丰镇","集宁","东胜","临河","二连浩特锡林浩特通辽","霍林郭勒","乌兰浩特","阿尔山","扎兰屯","牙克石","海拉尔","满洲里","额尔古纳根河","卓资","凉城","和林格尔","清水河","托克托","武川","固阳","五原","磴口","兴和","商都","化德","多伦","林西","宁城","开鲁","突泉","察哈尔右翼前旗　察哈尔右翼中旗　察哈尔右翼后旗　苏尼特左旗","苏尼特右旗","四子王旗","达尔罕茂明安联合旗","土默特左旗　土默特右旗","准格尔旗","达拉特旗","伊金霍洛旗乌拉特前旗　乌拉特中旗","乌拉特后旗","杭锦旗","杭锦后旗","鄂托克旗","鄂托克前旗","乌审旗","阿拉善左旗","阿拉善右旗","额济纳旗","镶黄旗","正镶白旗","太仆寺旗","正蓝旗","阿巴嘎旗","克什克腾旗","翁牛特旗","喀喇沁旗","敖汉旗","东乌珠穆沁旗","西乌珠穆沁旗","巴林左旗","巴林右旗","阿鲁科尔沁旗","奈曼旗","库伦旗","科尔沁左翼中旗　科尔沁左翼后旗","扎鲁特旗","科尔沁右翼中旗　科尔沁右翼前旗","扎赉特旗","新巴尔虎左旗","新巴尔","虎右旗","陈巴尔虎旗","阿荣旗","莫力达瓦达斡尔族自治旗","鄂伦春自治旗","鄂温克自治旗","辽宁省","沈阳","盘锦","锦州","葫芦岛","朝阳","阜新","铁岭","抚顺","本溪","丹东","辽阳","鞍山","营口","大连","新民","北宁","凌海","兴城","凌源","北票","铁法","开原","凤城","灯塔","海城","大石桥","盖州","东港","庄河","瓦房店","普兰店","辽中","台安","盘山","大洼","绥中","建昌","建平","朝阳","义县","黑山","彰武","铁岭","法库","康平","昌图","西丰","抚顺","辽阳","长海","喀喇沁左翼蒙古族自治县","阜新蒙古族自治县　新宾满族自治县","清原满族自治县","桓仁满族自治县　宽甸满族自治县　本溪满族自治县","岫岩满族自治县","吉林省","长春","四平","白城","松原","吉林","辽源","通化","白山","公主岭","双辽","洮南","大安","榆树","德惠","九台","舒兰","蛟河","敦化","图们","珲春","延吉","龙井","和龙","桦甸","磐石","梅河口","临江","集安","梨树","长岭","通榆","镇赉","乾安","扶余","农安","安图","汪清","永吉","东辽","东丰","辉南","柳河","靖宇","抚松","江源","通化","伊通满族自治县","长白朝鲜族自治县","前郭尔罗斯蒙古族自治县","黑龙江省","哈尔滨","大庆","齐齐哈尔黑河","伊春","牡丹江","鸡西","鹤岗","佳木斯","双鸭山","七台河","双城","肇东","安达","讷河","五大连池","北安","海伦","绥化","铁力","阿城","尚志","五常","海林","宁安","绥芬河","穆棱","富锦","同江","密山","虎林","呼兰","兰西","肇州","肇源","泰来","龙江","甘南","富裕","依安","克山","克东","嫩江","塔河","漠河","呼玛","孙吴","逊克","拜泉","林甸","明水","青冈","望奎","绥棱","庆安","嘉荫","萝北","巴彦","木兰","通河","方正","宾县","延寿","东宁","林口","鸡东","勃利","依兰","汤原","桦南","桦川","集贤","绥滨","友谊","宝清","饶河","抚远","杜尔伯特蒙古族自治县","上海市","黃浦区","南市区","卢湾区","徐汇区","长宁区","静安区","普陀区","闸北区","　","虹口区","杨浦区","闵行区","宝山区","嘉定区","浦东新区","金山区","松江区","青浦","奉贤","南汇","崇明","江苏省","南京","镇江","常州","无锡","苏州","扬州","泰州","南通","盐城","淮阴","宿迁","连云港","徐州","句容","丹阳","扬中","金坛","武进","溧阳","宜兴","江阴","张家港","常熟","太仓","昆山","锡山","吴县","吴江","仪征","江都","姜堰","泰兴","靖江","如皋","通州","海门","启东","高邮","兴化","东台","大丰","淮安","新沂","邳州","江宁","丹徒","溧水","高淳","江浦","六合","邗江","如东","海安","盐都","宝应","建湖","射阳","阜宁","滨海","涟水","灌南","响水","灌云","赣榆","东海","沭阳","淮阴","泗阳","洪泽","金湖","盱眙","泗洪","宿豫","睢宁","铜山","丰县","沛县","浙江省","杭州","嘉兴","湖州","绍兴","宁波","舟山","金华","衢州","台州","温州","余杭","海宁","桐乡","平湖","临安","富阳","萧山","上虞","慈溪","余姚","奉化","嵊州","诸暨","建德","义乌","东阳","兰溪","江山","永康","丽水","龙泉","临海","温岭","乐清","瑞安","海盐","嘉善","长兴","安吉","德清","绍兴","鄞县","岱山","嵊泗","象山","宁海","三门","天台","新昌","桐庐","淳安","浦江","磐安","金华","龙游","衢县","开化","常山","遂昌","松阳","武义","缙云","云和","庆元","泰顺","仙居","青田","永嘉","玉环","洞头","文成","平阳","苍南","景宁畲族自治县","安徽省","合肥","滁州","蚌埠","淮南","淮北","阜阳","安庆","芜湖","马鞍山","铜陵","黄山","巢湖","天长","明光","宿州","亳州","界首","六安","桐城","宣州","贵池","宁国","肥东","含山","和县","无为","全椒","来安","定远","凤阳","五河","泗县","固镇","灵璧","濉溪","萧县","砀山","涡阳","太和","临泉","阜南","利辛","蒙城","怀远","凤台","颍上","寿县","长丰","霍邱","金寨","肥西","舒城","霍山","庐江","枞阳","岳西","潜山","太湖","怀宁","宿松","望江","当涂","芜湖","繁昌","郎溪","广德","南陵","铜陵","青阳","泾县","东至","石台","祁门","旌德","绩溪","歙县","休宁","黟县","福建省","福州","莆田","泉州","南平","三明","龙岩","漳州","厦门","宁德","福安","福鼎","长乐","福清","南安","晋江","石狮","建瓯","建阳","武夷山","邵武","永安","漳平","龙海","闽侯","连江","罗源","霞浦","柘荣","寿宁","周宁","屏南","古田","闽清","政和","松溪","浦城","永泰","莆田","平潭","大田","德化","永春","仙游","安溪","惠安","光泽","顺昌","将乐","沙县","尤溪","泰宁","建宁","明溪","宁化","清流","长汀","连城","武平","上杭","永定","华安","长泰","南靖","平和","漳浦","云霄","东山","诏安","金门","江西省","南昌","鹰潭","景德镇","九江","新余","萍乡","临川","贵溪","上饶","乐平","德兴","瑞昌","高安","丰城","樟树","宜春","吉安","井冈山","赣州","南康","瑞金","新建","南昌","进贤","东乡","余江","金溪","资溪","弋阳","横峰","铅山","上饶","广丰","玉山","余干","万年","波阳","婺源","浮梁","都昌","湖口","彭泽","九江","星子","德安","永修","武宁","修水","铜鼓","靖安","奉新","安义","宜丰","上高","万载","分宜","芦溪","上栗","崇仁","宜黄","南城","黎川","南丰","广昌","石城","乐安","永丰","宁都","新干","峡江","吉水","安福","吉安","永新","莲花","宁冈","泰和","万安","兴国","遂川","赣县","上犹","崇义","大余","于都","会昌","信丰","安远","寻乌","全南","龙南","定南","山东省","济南","德州","聊城","东营","淄博","潍坊","青岛","烟台","威海","济宁","泰安","莱芜","日照","临沂","枣庄","临清","禹城","乐陵","滨州","章丘","青州","寿光","昌邑","安丘","高密","胶州","胶南","即墨","平度","莱西","莱州","招远","龙口","蓬莱","栖霞","莱阳","海阳","乳山","文登","荣成","菏泽","肥城","曲阜","兖州","邹城","新泰","诸城","滕州","齐河","茌平","东阿","阳谷","莘县","冠县","夏津","高唐","武城","平原","陵县","临邑","济阳","宁津","商河","惠民","庆云","无棣","阳信","沾化","利津","垦利","邹平","高青","博兴","桓台","广饶","临朐","昌乐","长岛","东明","鄄城","郓城","梁山","巨野","嘉祥","汶上","东平","平阴","长清","宁阳","泗水","平邑","蒙阴","沂源","沂水","五莲","沂南","莒县","莒南","费县","临沭","定陶","曹县","成武","单县","金乡","鱼台","微山","苍山","郯城","河南省","郑州","新乡","鹤壁","安阳","濮阳","开封","商丘","焦作","洛阳","三门峡","平顶山","南阳","许昌","漯河","信阳","辉县","卫辉","林州","永城","沁阳","济源","孟州","荥阳","新密","巩义","偃师","登封","新郑","长葛","禹州","汝州","义马","灵宝","舞钢","邓州","周口","项城","驻马店","新乡","原阳","淇县","汤阴","安阳","滑县","浚县","内黄","南乐","清丰","范县","台前","濮阳","长垣","延津","封丘","中牟","开封","兰考","民权","睢县","宁陵","虞城","夏邑","获嘉","修武","武陟","博爱","温县","许昌","襄城","郏县","宝丰","鲁山","伊川","宜阳","汝阳","嵩县","孟津","新安","渑池","陕县","洛宁","卢氏","栾川","西峡","淅川","内乡","镇平","南召","社旗","方城","叶县","临颍","郾城","舞阳","西平","遂平","泌阳","唐河","新野","桐柏","尉氏","通许","杞县","鄢陵","扶沟","太康","柘城","鹿邑","西华","淮阳","郸城","商水","沈丘","上蔡","汝南","平舆","确山","正阳","新蔡","罗山","息县","淮滨","固始","潢川","光山","商城","新县","湖北省","武汉","黄冈","鄂州","黄石","孝感","襄樊","十堰","荆门","荆州","宜昌","汉川","大冶","武穴","咸宁","赤壁","洪湖","麻城","应城","安陆","广水","随州","枣阳","宜城","老河口","丹江口","天门","钟祥","仙桃","潜江","石首","松滋","枝江","枝城","当阳","恩施","利川","团风","浠水","蕲春","黄梅","阳新","嘉鱼","通山","崇阳","通城","罗田","英山","新洲","黄陂","红安","大悟","孝昌","云梦","南漳","襄阳","保康","房县","谷城","郧县","郧西","竹山","竹溪","京山","监利","公安","远安","宜昌","兴山","秭归","巴东","鹤峰","建始","宣恩","咸丰","来凤","长阳土家族自治县","五峰土家族自治县","神农架","湖南省","长沙","岳阳","株洲","衡阳","郴州","永州","湘潭","邵阳","怀化","益阳","常德","张家界","浏阳","汨罗","临湘","醴陵","耒阳","常宁","资兴","韶山","湘乡","娄底","涟源","冷水江","沅江","津市","吉首","洪江","武冈","长沙","湘阴","岳阳","平江","湘潭","株洲","衡山","衡东","衡南","攸县","茶陵","安仁","炎陵","桂东","永兴","汝城","宜章","临武","桂阳","新田","嘉禾","宁远","蓝山","双牌","道县","江永","双峰","邵东","新邵","衡阳","祁东","祁阳","邵阳","东安","望城","宁乡","桃江","汉寿","桃源","华容","南县","安乡","临澧","澧县","石门","慈利","桑植","龙山","永顺","花垣","保靖","古丈","沅陵","安化","泸溪","新化","溆浦","辰溪","凤凰","中方","洞口","隆回","新宁","绥宁","会同","江华瑶族自治县","麻阳苗族自治县","芷江侗族自治县","新晃侗族自治县","靖州苗族侗族自治县通道侗族自治县","城步苗族自治县","广东省","广州","东莞","深圳","惠州","汕尾","汕头","揭阳","潮州","梅州","河源","韶关","清远","佛山","江门","中山","珠海","肇庆","云浮","阳江","茂名","湛江","增城","惠阳","陆丰","普宁","潮阳","澄海","兴宁","南雄","乐昌","连州","英德","从化","花都","三水","南海","番禺","顺德","高明","鹤山","新会","开平","台山","四会","高要","罗定","恩平","阳春","信宜","高州","吴川","化州","廉江","雷州","博罗","惠东","海丰","陆河","惠来","揭西","揭东","潮安","饶平","南澳","丰顺","大埔","蕉岭","平远","梅县","五华","龙川","和平","紫金","东源","连平","翁源","新丰","龙门","始兴","仁化","曲江","阳山","清新","佛冈","怀集","广宁","封开","郁南","德庆","云安","新兴","斗门","阳东","阳西","电白","遂溪","徐闻","乳源瑶族自治县","连南瑶族自治县","连山壮族瑶族自治县","广西壮族自治区","南宁","钦州","防城港","北海","贵港","玉林","梧州","柳州","桂林","东兴","北流","岑溪","桂平","贺州","合山","宜州","河池","凭祥","百色","邕宁","合浦","宾阳","横县","灵山","浦北","博白","陆川","兴业","容县","平南","藤县","苍梧","蒙山","昭平","钟山","阳朔","荔浦","平乐","灌阳","资源","全州","兴安","灵川","临桂","永福","鹿寨","融安","柳城","柳江","象州","武宣","来宾","忻城","马山","上林","武鸣","扶绥","上思","崇左","宁明","龙州","天峨","南丹","东兰","凤山","乐业","凌云","隆安","平果","田东","田阳","大新","天等","靖西","德保","那坡","田林","西林","富川瑶族自治县","恭城瑶族自治县","金秀瑶族自治县","龙胜各族自治县","三江侗族自治县","融水苗族自治县","罗城仫佬族自治县","环江毛南族自治县","都安瑶族自治县","大化瑶族自治县","巴马瑶族自治县","隆林各族自治县","海南省","海口","三亚","琼山","文昌","琼海","万宁","儋州","通什","东方","定安","屯昌","临高","澄迈","琼中黎族苗族自治县　保亭黎族苗族自治县　陵水黎族自治县","白沙黎族自治县","昌江黎族自治县　乐东黎族自治县","重庆市","渝中区","江北区","南岸区","沙坪坝区　九龙坡区　大渡口区　巴南区","北碚区　双桥区","万盛区","渝北区","涪陵区","万州区","合川","永川","江津","南川","潼南","铜梁","大足","荣昌","璧山","綦江","长寿","武隆","丰都","垫江","梁平","忠县","城口","开县","云阳","奉节","巫溪","巫山","石柱土家族自治县","彭水苗族土家族自治县","黔江土家族苗族自治县","酉阳土家族苗族自治县","秀山土家族苗族自治县","四川省","成都","德阳","绵阳","广元","遂宁","南充","广安","内江","自贡","泸州","宜宾","乐山","攀枝花","广汉","什邡","绵竹","江油","阆中","巴中","万源","达川","华蓥","简阳","资阳","都江堰","彭州","崇州","邛崃","雅安","峨眉山","西昌","郫县","新都","金堂","罗江","安县","北川","平武","青川","剑阁","梓潼","中江","三台","盐亭","射洪","蓬溪","大英","西充","南部","苍溪","旺苍","南江","岳池","武胜","通江","平昌","仪陇","宣汉","达县","开江","蓬安","营山","渠县","大竹","邻水","乐至","安岳","资中","温江","大邑","双流","新津","宝兴","芦山","天全","名山","蒲江","丹棱","洪雅","眉山","彭山","青神","仁寿","夹江","井研","威远","荣县","隆昌","富顺","泸县","犍为","沐川","屏山","宜宾","南溪","江安","合江","长宁","高县","珙县","筠连","兴文","叙永","古蔺","荥经","汉源","石棉","甘洛","越西","冕宁","喜德","美姑","雷波","昭觉","金阳","布拖","德昌","普格","宁南","盐源","米易","盐边","会理","会东","茂县","汶川","理县","松潘","九寨沟","若尔盖","红原","阿坝","黑水","马尔康","壤塘","色达","石渠","德格","甘孜","炉霍","道孚","新龙","白玉","金川","丹巴","小金","泸定","康定","雅江","理塘","巴塘","九龙","稻城","乡城","得荣","马边彝族自治县","峨边彝族自治县","木里藏族自治县","贵州省","贵阳","六盘水","遵义","清镇","安顺","兴义","毕节","仁怀","赤水","福泉","都匀","凯里","铜仁","平坝","惠水","长顺","普定","晴隆","普安","兴仁","贞丰","安龙","册亨","望谟","罗甸","织金","纳雍","水城","赫章","大方","黔西","修文","息烽","开阳","金沙","遵义","桐梓","习水","绥阳","正安","湄潭","凤冈","德江","思南","江口","石阡","岑巩","镇远","施秉","余庆","黄平","瓮安","龙里","贵定","麻江","台江","三穗","剑河","天柱","锦屏","黎平","榕江","从江","雷山","丹寨","独山","荔波","平塘","三都水族自治县","镇宁布依族苗族自治县","紫云苗族布依族自治县","关岭布依族苗族自治县","道真仡佬族苗族自治县","务川仡佬族苗族自治县","沿河土家族自治县","印江土家族苗族自治县","松桃苗族自治县","玉屏侗族自治县","威宁彝族回族苗族自治县","六枝","盘县","万山","云南省","昆明","东川","曲靖","玉溪","宣威","昭通","安宁","开远","个旧","楚雄","大理","保山","潞西","畹町","瑞丽","思茅","景洪","嵩明","马龙","沾益","富源","会泽","巧家","鲁甸","大关","彝良","镇雄","威信","永善","盐津","绥江","水富","呈贡","宜良","陆良","师宗","罗平","晋宁","易门","双柏","澄江","江川","华宁","通海","石屏","建水","蒙自","红河","元阳","绿春","泸西","弥勒","丘北","文山","砚山","马关","麻栗坡","西畴","广南","富宁","富民","禄丰","武定","元谋","永仁","大姚","姚安","牟定","南华","华坪","永胜","鹤庆","剑川","中甸","德钦","福贡","洱源","宾川","祥云","弥渡","永平","云龙","泸水","腾冲","梁河","盈江","陇川","龙陵","施甸","昌宁","凤庆","云县","永德","镇康","临沧","勐海","勐腊","寻甸回族彝族自治县","石林彝族自治县","峨山彝族自治县","屏边苗族自治县","金平苗族瑶族傣族自治县","河口瑶族自治县","禄劝彝族苗族自治县","丽江纳西","族自治县","宁蒗彝族自治县","贡山独龙族怒族自治县","维西傈僳族自治县","兰坪白族普米族自治县","漾濞彝族自治县","巍山彝族回族自治县","南涧彝族自治县","景东彝族自治县","镇沅彝族哈尼族拉祜族自治县","新平彝族傣族自治县","耿马傣族佤族自治县","双江拉祜族佤族布朗族傣族自治县","沧源佤族自治县","景谷傣族彝族自治县","墨江哈尼族自治县","元江哈尼族彝族傣族自治县","普洱哈尼族彝族自治县","西盟佤族自治县","澜沧拉祜族自治县","孟连傣族拉祜族佤族自治县","江城哈尼族彝族自治县","西藏自治区","拉萨","日喀则","堆龙德庆林周","达孜","墨竹工卡工布江达","林芝","墨脱","曲水","贡嘎","扎囊","乃东","桑日","琼结","洛扎","措美","曲松","隆子","错那","加查","朗县","米林","当雄","那曲","聂荣","安多","索县","巴青","比如","边坝","嘉黎","波密","洛隆","丁青","类乌齐","昌都","妥坝","生达","江达","贡觉","察雅","八宿","左贡","芒康","碧土","盐井","察隅","尼木","浪卡子","仁布","江孜","康马","亚东","岗巴","定结","白朗","南木林","谢通门","萨迦","拉孜","昂仁","定日","萨嘎","吉隆","聂拉木","班戈","申扎","尼玛","措勤","改则","隆格尔","仲巴","普兰","札达","革吉","噶尔","日土","陕西省","西安","渭南","铜川","延安","咸阳","宝鸡","汉中","华阴","韩城","榆林","兴平","安康","商州","长安","泾阳","三原","高陵","富平","华县","潼关","大荔","蒲城","白水","澄城","合阳","耀县","宜君","黄陵","黄龙","洛川","富县","宜川","甘泉","延长","延川","清涧","子长","安塞","志丹","吴旗","定边","靖边","横山","子洲","绥德","吴堡","米脂","佳县","神木","府谷","淳化","旬邑","彬县","长武","户县","周至","武功","礼泉","乾县","永寿","麟游","扶风","眉县","岐山","宝鸡","凤翔","千阳","陇县","太白","凤县","留坝","略阳","宁强","勉县","南郑","城固","洋县","西乡","镇巴","佛坪","宁陕","石泉","汉阴","紫阳","岚皋","平利","镇坪","旬阳","白河","镇安","柞水","蓝田","洛南","丹凤","商南","山阳","甘肃省","兰州","天水","白银","金昌","嘉峪关","临夏","合作","平凉","西峰","武威","张掖","酒泉","玉门","敦煌","永靖","临夏","夏河","和政","广河","康乐","临洮","碌曲","玛曲","临潭","卓尼","岷县","宕昌","迭部","舟曲","榆中","定西","会宁","静宁","通渭","渭源","陇西","漳县","武山","甘谷","秦安","清水","礼县","西和","两当","徽县","成县","武都","康县","文县","庄浪","华亭","崇信","灵台","泾川","宁县","正宁","合水","镇原","庆阳","环县","华池","皋兰","靖远","景泰","永登","古浪","民勤","永昌","山丹","民乐","临泽","高台","金塔","安西","东乡族自治县","张家川回族自治县","天祝藏族自治县","肃南裕固族自治县","肃北蒙古族自治县","阿克塞哈萨克族自治县","积石山保安族撒拉族东乡族自治县","青海省","西宁","德令哈","格尔木","平安","乐都","湟中","湟源","海晏","刚察","祁连","共和","贵德","尖扎","同仁","泽库","贵南","同德","兴海","玛沁","甘德","达日","久治","班玛","天峻","乌兰","都兰","玛多","称多","玉树","曲麻莱","治多","杂多","囊谦","民和回族土族自治县","化隆回族自治县","互助土族自治县","门源回族自治县","循化撒拉族自治县","河南蒙古族自治县","大通回族土族自治县","宁夏回族自治区","银川","石嘴山","吴忠","青铜峡","灵武","贺兰","陶乐","平罗","惠农","永宁","盐池","中宁","中卫","同心","海原","西吉","固原","彭阳","隆德","泾源","新疆维吾尔自治区","乌鲁木齐　克拉玛依","吐鲁番","哈密","米泉","阜康","昌吉","石河子","奎屯","乌苏","博乐","塔城","阿勒泰","伊宁","库尔勒","阿克苏","喀什","阿图什","和田","　","乌鲁木齐托克逊","鄯善","吉木萨尔奇台","伊吾","玛纳斯","呼图壁","沙湾","精河","温泉","托里","裕民","额敏","福海","吉木乃","布尔津","哈巴河","富蕴","青河","霍城","伊宁","尼勒克","巩留","新源","昭苏","特克斯","和静","和硕","博湖","尉犁","轮台","库车","新和","沙雅","拜城","温宿","乌什","阿瓦提","阿合奇","柯坪","巴楚","麦盖提","岳普湖","英吉沙","阿克陶","伽师","疏勒","疏附","乌恰","莎车","泽普","叶城","皮山","墨玉","和田","洛浦","策勒","于田","民丰","且末","若羌","木垒哈萨克自治县","巴里坤哈萨克自治县","和布克赛尔蒙古自治县","察布查尔锡伯自治县","塔什库尔干塔吉克自治县","焉耆回族自治县","台湾省","　","台北","基隆","新竹","台中","嘉义","台南","高雄","　","台北","桃园","新竹","苗栗","台中","彰化","南投","云林","嘉义","台南","高雄","屏东","台东","花莲","宜兰","澎湖");

    private String[][]data ={{"北京","东城","西城","崇文","宣武","朝阳","海淀","丰台","通州","顺义","房山","石景山","门头沟","大兴","昌平","延庆","怀柔","密云","平谷"},{"天津","和平","河东","南开","河西","河北","红桥","塘沽","汉沽","大港","东丽","西青","津南","北辰","武清","宝坻","蓟县","静海","宁河"},{"河北","石家庄","邢台","邯郸","衡水","沧州","保定","廊坊","张家口","承德","唐山","秦皇岛","鹿泉","沙河","武安","南宫","冀州","藁城","晋州","辛集","深州","泊头","黄骅","新乐","安国","","定州","河间","任丘","高碑店","涿州","霸州","遵化","丰南","迁安","三河","井陉","元氏","赞皇","高邑","临城","内丘","邢台","永年","涉县","磁县","临漳","魏县","","大名","邯郸","成安","肥乡","广平","馆陶","曲周","邱县","临西","南和","鸡泽","威县","任县","巨鹿","平乡","广宗","清河","故城","隆尧","柏乡","枣强","新河","宁晋","赵县","栾城","平山","灵寿","行唐","曲阳","唐县","望都","顺平","满城","阜平","易县","涞水","涞源","定兴","正定","无极","深泽","安平","饶阳","武强","武邑","献县","阜城","景县","吴桥","东光","南皮","沧县","盐山","海兴","青县","博野","蠡县","肃宁","清苑","高阳","大城","文安","安新","徐水","容城","雄县","永清","固安","蔚县","阳原","涿鹿","怀来","宣化","怀安","万全","尚义","崇礼","张北","康保","沽源","赤城","隆化","滦平","承德","平泉","兴隆","迁西","玉田","丰润","卢龙","抚宁","滦县","昌黎","滦南","乐亭","唐海","香河","孟村回族","青龙满族","围场满族蒙古族","宽城满族","丰宁满族","大厂回族"},{"山西","太原","阳泉","朔州","大同","长治","晋城","古交","忻州","原平","榆次","介休","孝义","汾阳","离石","霍州","临汾","侯马","河津","运城","永济","潞城","高平","阳曲","定襄","五台","代县","繁峙","灵丘","宁武","神池","山阴","应县","浑源","广灵","怀仁","大同","阳高","天镇","左云","右玉","偏关","河曲","保德","五寨","岢岚","兴县","岚县","静乐","娄烦","方山","临县","清徐","交城","文水","柳林","中阳","交口","石楼","灵石","汾西","洪洞","隰县","永和","大宁","蒲县","吉县","乡宁","襄汾","曲沃","新绛","稷山","绛县","垣曲","闻喜","夏县","平陆","万荣","临猗","芮城","盂县","寿阳","平定","昔阳","和顺","左权","榆社","沁县","襄垣","武乡","太谷","祁县","平遥","沁源","古县","安泽","浮山","翼城","沁水","阳城","黎城","屯留","长子","壶关","长治","平顺","陵川","泽州"},{"内蒙古","呼和浩特包头","乌海","赤峰","丰镇","集宁","东胜","临河","二连浩特锡林浩特通辽","霍林郭勒","乌兰浩特","阿尔山","扎兰屯","牙克石","海拉尔","满洲里","额尔古纳根河","卓资","凉城","和林格尔","清水河","托克托","武川","固阳","五原","磴口","兴和","商都","","化德","多伦","林西","宁城","开鲁","突泉","察哈尔右翼前旗　察哈尔右翼中旗　察哈尔右翼后旗　苏尼特左旗","苏尼特右旗","四子王旗","达尔罕茂明安联合旗","土默特左旗　土默特右旗","","准格尔旗","达拉特旗","伊金霍洛旗乌拉特前旗　乌拉特中旗","乌拉特后旗","","杭锦旗","杭锦后旗","鄂托克旗","鄂托克前旗","乌审旗","阿拉善左旗","阿拉善右旗","额济纳旗","镶黄旗","正镶白旗","太仆寺旗","正蓝旗","阿巴嘎旗","克什克腾旗","","翁牛特旗","喀喇沁旗","敖汉旗","东乌珠穆沁旗","西乌珠穆沁旗","巴林左旗","","巴林右旗","阿鲁科尔沁旗","奈曼旗","库伦旗","科尔沁左翼中旗　科尔沁左翼后旗","扎鲁特旗","科尔沁右翼中旗　科尔沁右翼前旗","扎赉特旗","新巴尔虎左旗","","新巴尔","虎右旗","陈巴尔虎旗","阿荣旗","莫力达瓦达斡尔族自治旗","鄂伦春自治旗","鄂温克自治旗"},{"辽宁","沈阳","盘锦","锦州","葫芦岛","朝阳","阜新","铁岭","抚顺","本溪","丹东","辽阳","鞍山","营口","大连","新民","北宁","凌海","兴城","凌源","北票","铁法","开原","凤城","灯塔","海城","大石桥","盖州","东港","庄河","瓦房店","普兰店","辽中","台安","盘山","大洼","绥中","建昌","建平","朝阳","义县","黑山","彰武","铁岭","法库","康平","昌图","西丰","抚顺","辽阳","长海","喀喇沁左翼蒙古族","阜新蒙古族　新宾满族","清原满族","","桓仁满族　宽甸满族　本溪满族","","岫岩满族"},{"吉林","长春","四平","白城","松原","吉林","辽源","通化","白山","公主岭","双辽","洮南","大安","榆树","德惠","九台","舒兰","蛟河","敦化","图们","珲春","延吉","龙井","和龙","桦甸","磐石","梅河口","临江","集安","梨树","长岭","通榆","镇赉","乾安","扶余","农安","安图","汪清","永吉","东辽","东丰","","辉南","柳河","靖宇","抚松","江源","通化","伊通满族","长白朝鲜族","前郭尔罗斯蒙古族"},{"黑龙江","哈尔滨","大庆","齐齐哈尔黑河","伊春","牡丹江","鸡西","鹤岗","佳木斯","双鸭山","七台河","双城","肇东","安达","讷河","五大连池","北安","海伦","绥化","铁力","阿城","尚志","五常","海林","宁安","绥芬河","穆棱","富锦","同江","密山","虎林","呼兰","兰西","肇州","肇源","泰来","龙江","甘南","富裕","依安","克山","克东","嫩江","塔河","漠河","呼玛","孙吴","逊克","拜泉","林甸","明水","青冈","望奎","绥棱","庆安","嘉荫","萝北","巴彦","木兰","通河","方正","宾县","延寿","东宁","林口","鸡东","勃利","依兰","汤原","桦南","桦川","集贤","绥滨","友谊","宝清","饶河","抚远","杜尔伯特蒙古族"},{"上海","黃浦","南","卢湾","徐汇","长宁","静安","普陀","闸北","　","虹口","杨浦","闵行","宝山","嘉定","浦东新","金山","松江","青浦","奉贤","南汇","崇明"},{"江苏","南京","镇江","常州","无锡","苏州","扬州","泰州","南通","盐城","淮阴","宿迁","连云港","徐州","句容","丹阳","扬中","金坛","武进","溧阳","宜兴","江阴","张家港","常熟","太仓","昆山","锡山","吴县","吴江","仪征","江都","姜堰","泰兴","靖江","如皋","通州","海门","启东","高邮","兴化","东台","大丰","淮安","新沂","邳州","江宁","丹徒","溧水","高淳","江浦","六合","邗江","如东","海安","盐都","宝应","建湖","射阳","阜宁","滨海","涟水","灌南","响水","灌云","赣榆","东海","沭阳","淮阴","泗阳","洪泽","金湖","盱眙","泗洪","宿豫","睢宁","铜山","丰县","沛县"},{"浙江","杭州","嘉兴","湖州","绍兴","宁波","舟山","金华","衢州","台州","温州","余杭","海宁","桐乡","平湖","临安","富阳","萧山","上虞","慈溪","余姚","奉化","嵊州","诸暨","建德","义乌","东阳","兰溪","江山","永康","丽水","龙泉","临海","温岭","乐清","瑞安","海盐","嘉善","长兴","安吉","德清","绍兴","鄞县","岱山","嵊泗","象山","宁海","三门","天台","新昌","桐庐","淳安","浦江","磐安","金华","龙游","衢县","开化","常山","遂昌","松阳","武义","缙云","云和","庆元","泰顺","仙居","青田","永嘉","玉环","洞头","文成","平阳","苍南","景宁畲族"},{"安徽","合肥","滁州","蚌埠","淮南","淮北","阜阳","安庆","芜湖","马鞍山","铜陵","黄山","巢湖","天长","明光","宿州","亳州","界首","六安","桐城","宣州","贵池","宁国","肥东","含山","和县","无为","全椒","来安","定远","凤阳","五河","泗县","固镇","灵璧","濉溪","萧县","砀山","涡阳","太和","临泉","阜南","利辛","蒙城","怀远","凤台","颍上","寿县","长丰","霍邱","金寨","肥西","舒城","霍山","庐江","枞阳","岳西","潜山","太湖","怀宁","宿松","望江","当涂","芜湖","繁昌","郎溪","广德","南陵","铜陵","青阳","泾县","东至","石台","祁门","旌德","绩溪","歙县","休宁","黟县"},{"福建","福州","莆田","泉州","南平","三明","龙岩","漳州","厦门","宁德","福安","福鼎","长乐","福清","南安","晋江","石狮","建瓯","建阳","武夷山","邵武","永安","漳平","龙海","闽侯","连江","罗源","霞浦","柘荣","寿宁","周宁","屏南","古田","闽清","政和","松溪","浦城","永泰","莆田","平潭","大田","德化","永春","仙游","安溪","惠安","光泽","顺昌","将乐","沙县","尤溪","泰宁","建宁","明溪","宁化","清流","长汀","连城","武平","上杭","永定","华安","长泰","南靖","平和","漳浦","云霄","东山","诏安","金门"},{"江西","南昌","鹰潭","景德镇","九江","新余","萍乡","临川","贵溪","上饶","乐平","德兴","瑞昌","高安","丰城","樟树","宜春","吉安","井冈山","赣州","南康","瑞金","新建","南昌","进贤","东乡","余江","金溪","资溪","弋阳","横峰","铅山","上饶","广丰","玉山","余干","万年","波阳","婺源","浮梁","都昌","湖口","彭泽","九江","星子","德安","永修","武宁","修水","铜鼓","靖安","奉新","安义","宜丰","上高","万载","分宜","芦溪","上栗","崇仁","宜黄","南城","黎川","南丰","广昌","石城","乐安","永丰","宁都","新干","峡江","吉水","安福","吉安","永新","莲花","宁冈","泰和","万安","兴国","遂川","赣县","上犹","崇义","大余","于都","会昌","信丰","安远","寻乌","全南","龙南","定南"},{"山东","济南","德州","聊城","东营","淄博","潍坊","青岛","烟台","威海","济宁","泰安","莱芜","日照","临沂","枣庄","临清","禹城","乐陵","滨州","章丘","青州","寿光","昌邑","安丘","高密","胶州","胶南","即墨","平度","莱西","莱州","招远","龙口","蓬莱","栖霞","莱阳","海阳","乳山","文登","荣成","菏泽","肥城","曲阜","兖州","邹城","新泰","诸城","滕州","齐河","茌平","东阿","阳谷","莘县","冠县","夏津","高唐","武城","平原","陵县","临邑","济阳","宁津","商河","惠民","庆云","无棣","阳信","沾化","利津","垦利","邹平","高青","博兴","桓台","广饶","临朐","昌乐","长岛","东明","鄄城","郓城","梁山","巨野","嘉祥","汶上","东平","平阴","长清","宁阳","泗水","平邑","蒙阴","沂源","沂水","五莲","沂南","莒县","莒南","费县","临沭","定陶","曹县","成武","单县","金乡","鱼台","微山","苍山","郯城"},{"河南","郑州","新乡","鹤壁","安阳","濮阳","开封","商丘","焦作","洛阳","三门峡","平顶山","南阳","许昌","漯河","信阳","辉县","卫辉","林州","永城","沁阳","济源","孟州","荥阳","新密","巩义","偃师","登封","新郑","长葛","禹州","汝州","义马","灵宝","舞钢","邓州","周口","项城","驻马店","新乡","原阳","淇县","汤阴","安阳","滑县","浚县","内黄","南乐","清丰","范县","台前","濮阳","长垣","延津","封丘","中牟","开封","兰考","民权","睢县","宁陵","虞城","夏邑","获嘉","修武","武陟","博爱","温县","许昌","襄城","郏县","宝丰","鲁山","伊川","宜阳","汝阳","嵩县","孟津","新安","渑池","陕县","洛宁","卢氏","栾川","西峡","淅川","内乡","镇平","南召","社旗","方城","叶县","临颍","郾城","舞阳","西平","遂平","泌阳","唐河","新野","桐柏","尉氏","通许","杞县","鄢陵","扶沟","太康","柘城","鹿邑","西华","淮阳","郸城","商水","沈丘","上蔡","汝南","平舆","确山","正阳","新蔡","罗山","息县","淮滨","固始","潢川","光山","商城","新县"},{"湖北","武汉","黄冈","鄂州","黄石","孝感","襄樊","十堰","荆门","荆州","宜昌","汉川","大冶","武穴","咸宁","赤壁","洪湖","麻城","应城","安陆","广水","随州","枣阳","宜城","老河口","丹江口","天门","钟祥","仙桃","潜江","石首","松滋","枝江","枝城","当阳","恩施","利川","团风","浠水","蕲春","黄梅","阳新","嘉鱼","通山","崇阳","通城","罗田","英山","新洲","黄陂","红安","大悟","孝昌","云梦","南漳","襄阳","保康","房县","谷城","郧县","郧西","竹山","竹溪","京山","监利","公安","远安","宜昌","兴山","秭归","巴东","鹤峰","建始","宣恩","咸丰","来凤","长阳土家族","五峰土家族","神农架"},{"湖南","长沙","岳阳","株洲","衡阳","郴州","永州","湘潭","邵阳","怀化","益阳","常德","张家界","浏阳","汨罗","临湘","醴陵","耒阳","常宁","资兴","韶山","湘乡","娄底","涟源","冷水江","沅江","津","吉首","洪江","武冈","长沙","湘阴","岳阳","平江","湘潭","株洲","衡山","衡东","衡南","攸县","茶陵","安仁","炎陵","桂东","永兴","汝城","宜章","临武","桂阳","新田","嘉禾","宁远","蓝山","双牌","道县","江永","双峰","邵东","新邵","衡阳","祁东","祁阳","邵阳","东安","望城","宁乡","桃江","汉寿","桃源","华容","南县","安乡","临澧","澧县","石门","慈利","桑植","龙山","永顺","花垣","保靖","古丈","沅陵","安化","泸溪","新化","溆浦","辰溪","凤凰","中方","洞口","隆回","新宁","绥宁","会同","江华瑶族","麻阳苗族","芷江侗族","新晃侗族","","靖州苗族侗族通道侗族","城步苗族"},{"广东","广州","东莞","深圳","惠州","汕尾","汕头","揭阳","潮州","梅州","河源","韶关","清远","佛山","江门","中山","珠海","肇庆","云浮","阳江","茂名","湛江","增城","惠阳","陆丰","普宁","潮阳","澄海","兴宁","南雄","乐昌","连州","英德","从化","花都","三水","南海","番禺","顺德","高明","鹤山","新会","开平","台山","四会","高要","罗定","恩平","阳春","信宜","高州","吴川","化州","廉江","雷州","博罗","惠东","海丰","陆河","惠来","揭西","揭东","潮安","饶平","南澳","丰顺","大埔","蕉岭","平远","梅县","五华","龙川","和平","紫金","东源","连平","翁源","新丰","龙门","始兴","仁化","曲江","阳山","清新","佛冈","怀集","广宁","封开","郁南","德庆","云安","新兴","斗门","阳东","阳西","电白","遂溪","徐闻","乳源瑶族","连南瑶族","连山壮族瑶族"},{"广西壮族","南宁","钦州","防城港","北海","贵港","玉林","梧州","柳州","桂林","东兴","北流","岑溪","桂平","贺州","合山","宜州","河池","凭祥","百色","邕宁","合浦","宾阳","横县","灵山","浦北","博白","陆川","兴业","容县","平南","藤县","苍梧","蒙山","昭平","钟山","阳朔","荔浦","平乐","灌阳","资源","全州","兴安","灵川","临桂","永福","鹿寨","融安","柳城","柳江","象州","武宣","来宾","忻城","马山","上林","武鸣","扶绥","上思","崇左","宁明","龙州","天峨","南丹","东兰","凤山","乐业","凌云","隆安","平果","田东","田阳","大新","天等","靖西","德保","那坡","田林","西林","富川瑶族","恭城瑶族","金秀瑶族","龙胜各族","","三江侗族","融水苗族","罗城仫佬族","环江毛南族","","都安瑶族","大化瑶族","巴马瑶族","隆林各族"},{"海南","海口","三亚","琼山","文昌","琼海","万宁","儋州","通什","东方","定安","屯昌","临高","澄迈","琼中黎族苗族　保亭黎族苗族　陵水黎族","白沙黎族","昌江黎族　乐东黎族"},{"重庆","渝中","江北","南岸","沙坪坝　九龙坡　大渡口　巴南","","北碚　双桥","万盛","渝北","涪陵","万州","合川","永川","江津","南川","潼南","铜梁","大足","荣昌","璧山","綦江","长寿","武隆","丰都","垫江","梁平","忠县","城口","开县","云阳","奉节","巫溪","巫山","石柱土家族","彭水苗族土家族","黔江土家族苗族","酉阳土家族苗族","秀山土家族苗族"},{"四川","成都","德阳","绵阳","广元","遂宁","南充","广安","内江","自贡","泸州","宜宾","乐山","攀枝花","广汉","什邡","绵竹","江油","阆中","巴中","万源","达川","华蓥","简阳","资阳","都江堰","彭州","崇州","邛崃","雅安","峨眉山","西昌","郫县","新都","金堂","罗江","安县","北川","平武","青川","剑阁","梓潼","中江","三台","盐亭","射洪","蓬溪","大英","西充","南部","苍溪","旺苍","南江","岳池","武胜","通江","平昌","仪陇","宣汉","达县","开江","蓬安","营山","渠县","大竹","邻水","乐至","安岳","资中","温江","大邑","双流","新津","宝兴","芦山","天全","名山","蒲江","丹棱","洪雅","眉山","彭山","青神","仁寿","夹江","井研","威远","荣县","隆昌","富顺","泸县","犍为","沐川","屏山","宜宾","南溪","江安","合江","长宁","高县","珙县","筠连","兴文","叙永","古蔺","荥经","汉源","石棉","甘洛","越西","冕宁","喜德","美姑","雷波","昭觉","金阳","布拖","德昌","普格","宁南","盐源","米易","盐边","会理","会东","茂县","汶川","理县","松潘","九寨沟","若尔盖","红原","阿坝","黑水","马尔康","壤塘","色达","石渠","德格","甘孜","炉霍","道孚","新龙","白玉","金川","丹巴","小金","泸定","康定","雅江","理塘","巴塘","九龙","稻城","乡城","得荣","马边彝族","峨边彝族","木里藏族"},{"贵州","贵阳","六盘水","遵义","清镇","安顺","兴义","毕节","仁怀","赤水","福泉","都匀","凯里","铜仁","平坝","惠水","长顺","普定","晴隆","普安","兴仁","贞丰","安龙","册亨","望谟","罗甸","织金","纳雍","水城","赫章","大方","黔西","修文","息烽","开阳","金沙","遵义","桐梓","习水","绥阳","正安","湄潭","凤冈","德江","思南","江口","石阡","岑巩","镇远","施秉","余庆","黄平","瓮安","龙里","贵定","麻江","台江","三穗","剑河","天柱","锦屏","黎平","榕江","从江","雷山","丹寨","独山","荔波","平塘","三都水族","镇宁布依族苗族","紫云苗族布依族","关岭布依族苗族","道真仡佬族苗族","务川仡佬族苗族","","沿河土家族","印江土家族苗族","松桃苗族","玉屏侗族","","威宁彝族回族苗族六枝","盘县","万山"},{"云南","昆明","东川","曲靖","玉溪","宣威","昭通","安宁","开远","个旧","楚雄","大理","保山","潞西","畹町","瑞丽","思茅","景洪","嵩明","马龙","沾益","富源","会泽","巧家","鲁甸","大关","彝良","镇雄","威信","永善","盐津","绥江","水富","呈贡","宜良","陆良","师宗","罗平","晋宁","易门","双柏","澄江","江川","华宁","通海","石屏","建水","蒙自","红河","元阳","绿春","泸西","弥勒","丘北","文山","砚山","马关","麻栗坡","西畴","广南","富宁","富民","禄丰","武定","元谋","永仁","大姚","姚安","牟定","南华","华坪","永胜","鹤庆","剑川","中甸","德钦","福贡","洱源","宾川","祥云","弥渡","永平","云龙","泸水","腾冲","梁河","盈江","陇川","龙陵","施甸","昌宁","凤庆","云县","永德","镇康","临沧","勐海","勐腊","寻甸回族彝族","石林彝族","峨山彝族","屏边苗族","金平苗族瑶族傣族","河口瑶族","禄劝彝族苗族","丽江纳西","族","宁蒗彝族","贡山独龙族怒族","维西傈僳族","兰坪白族普米族","漾濞彝族","巍山彝族回族","南涧彝族","景东彝族","镇沅彝族哈尼族拉祜族","新平彝族傣族","耿马傣族佤族","双江拉祜族佤族布朗族傣族","沧源佤族","景谷傣族彝族","墨江哈尼族","元江哈尼族彝族傣族","普洱哈尼族彝族","西盟佤族","澜沧拉祜族","孟连傣族拉祜族佤族","江城哈尼族彝族"},{"西藏","拉萨","日喀则","堆龙德庆林周","达孜","墨竹工卡工布江达","林芝","墨脱","曲水","贡嘎","扎囊","乃东","桑日","琼结","洛扎","措美","曲松","隆子","错那","加查","朗县","米林","当雄","那曲","聂荣","安多","索县","巴青","比如","边坝","嘉黎","波密","洛隆","丁青","类乌齐","昌都","妥坝","生达","江达","贡觉","察雅","八宿","左贡","芒康","碧土","盐井","察隅","尼木","浪卡子","仁布","江孜","康马","亚东","岗巴","定结","白朗","南木林","谢通门","萨迦","拉孜","昂仁","定日","萨嘎","吉隆","聂拉木","班戈","申扎","尼玛","措勤","改则","隆格尔","仲巴","普兰","札达","革吉","噶尔","日土"},{"陕西","西安","渭南","铜川","延安","咸阳","宝鸡","汉中","华阴","韩城","榆林","兴平","安康","商州","长安","泾阳","三原","高陵","富平","华县","潼关","大荔","蒲城","白水","澄城","合阳","耀县","宜君","黄陵","黄龙","洛川","富县","宜川","甘泉","延长","延川","清涧","子长","安塞","志丹","吴旗","定边","靖边","横山","子洲","绥德","吴堡","米脂","佳县","神木","府谷","淳化","旬邑","彬县","长武","户县","周至","武功","礼泉","乾县","永寿","麟游","扶风","眉县","岐山","宝鸡","凤翔","千阳","陇县","太白","凤县","留坝","略阳","宁强","勉县","南郑","城固","洋县","西乡","镇巴","佛坪","宁陕","石泉","汉阴","紫阳","岚皋","平利","镇坪","旬阳","白河","镇安","柞水","蓝田","洛南","丹凤","商南","山阳"},{"甘肃","兰州","天水","白银","金昌","嘉峪关","临夏","合作","平凉","西峰","武威","张掖","酒泉","玉门","敦煌","永靖","临夏","夏河","和政","广河","康乐","临洮","碌曲","玛曲","临潭","卓尼","岷县","宕昌","迭部","舟曲","榆中","定西","会宁","静宁","通渭","渭源","陇西","漳县","武山","甘谷","秦安","清水","礼县","西和","两当","徽县","成县","武都","康县","文县","庄浪","华亭","崇信","灵台","泾川","宁县","正宁","合水","镇原","庆阳","环县","华池","皋兰","靖远","景泰","永登","古浪","民勤","永昌","山丹","民乐","临泽","高台","金塔","安西","东乡族","张家川回族","天祝藏族","肃南裕固族","肃北蒙古族","阿克塞哈萨克族","积石山保安族撒拉族东乡族"},{"青海","西宁","德令哈","格尔木","平安","乐都","湟中","湟源","海晏","刚察","祁连","共和","贵德","尖扎","同仁","泽库","贵南","同德","兴海","玛沁","甘德","达日","久治","班玛","天峻","乌兰","都兰","玛多","称多","玉树","曲麻莱","治多","杂多","囊谦","民和回族土族","化隆回族","互助土族","门源回族","循化撒拉族","河南蒙古族","大通回族土族"},{"宁夏回族","银川","石嘴山","吴忠","青铜峡","灵武","贺兰","陶乐","平罗","惠农","永宁","盐池","中宁","中卫","同心","海原","西吉","固原","彭阳","隆德","泾源"},{"新疆维吾尔","乌鲁木齐　克拉玛依","吐鲁番","哈密","米泉","阜康","昌吉","石河子","奎屯","乌苏","博乐","塔城","阿勒泰","伊宁","库尔勒","阿克苏","喀什","阿图什","和田　","乌鲁木齐托克逊","鄯善","吉木萨尔奇台","伊吾","玛纳斯","呼图壁","沙湾","精河","温泉","","托里","裕民","额敏","福海","吉木乃","布尔津","哈巴河","富蕴","青河","霍城","伊宁","尼勒克","","巩留","新源","昭苏","特克斯","和静","和硕","博湖","尉犁","轮台","库车","新和","沙雅","拜城","","温宿","乌什","阿瓦提","阿合奇","柯坪","巴楚","麦盖提","岳普湖","英吉沙","阿克陶","伽师","","疏勒","疏附","乌恰","莎车","泽普","叶城","皮山","墨玉","和田","洛浦","策勒","于田","民丰","","且末","若羌","木垒哈萨克","巴里坤哈萨克","和布克赛尔蒙古","","察布查尔锡伯","塔什库尔干塔吉克","焉耆回族","台湾","　","台北","基隆","新竹","台中","嘉义","台南","高雄　","台北","桃园","新竹","苗栗","台中","彰化","南投","云林","嘉义","台南","高雄","屏东","台东","","花莲","宜兰","澎湖"}};

    public Map<String,String> buildMap(){
        Map<String,String> map = new HashMap<String, String>();

        for(String [] data_1 : data){
            for(String data_2 : data_1){
                map.put(data_2,data_1[0]);
            }
        }
        return map;
    }

    public List<String[]> seperate(List<String> content, String seperator) {
        List<String[]> result = new ArrayList<String[]>();
        for (String string : content) {
            result.add(string.split(seperator));
        }
        return result;
    }

    public void preprocess_label(String file, String save) {

        try {
            String[] regex = {"(辽宁|吉林|黑龙江).+\n", "(河北|山西|内蒙古|北京|天津).+\n", "(山东|江苏|安徽|浙江|台湾|福建|江西|上海).+\n", "(河南|湖北|湖南).+\n", "(广东|广西|海南|香港|澳门).+\n", "(云南|重庆|贵州|四川|西藏).+\n", "(新疆|陕西|宁夏|青海|甘肃).+\n", "((海外|None).+\n)|((海外|None).+)"};
            String[] newString = {"东北\n", "华北\n", "华东\n", "华中\n", "华南\n", "西南\n", "西北\n", "境外\n"};
            String content = CommonTools.fileReader.readContent(file);
            for (int i = 0; i < regex.length; i++) {
                content = content.replaceAll(regex[i], newString[i]);
            }
            String [] tmp = content.split("\n");
            StringBuffer stringBuffer = new StringBuffer();
            for(int i=0;i< tmp.length;i++){
                String [] tt = tmp[i].split("\\|\\|");
                stringBuffer.append(tt[0]+"||");
                stringBuffer.append(tt[1]+"||");
                String age="";
                if(Integer.parseInt(tt[2]) > 1990){
                    age = "c";
                }else if(Integer.parseInt(tt[2]) < 1980){
                    age = "a";
                }else{
                    age ="b";
                }
                stringBuffer.append(age+"||");
                stringBuffer.append(tt[3]);
                stringBuffer.append("\n");
            }


            CommonTools.fileReader.write(save, stringBuffer.toString(), "utf-8", false);
        } catch (IOException e) {
            // TODO Auto-generated catch block
            e.printStackTrace();
        }
    }

    public void preprocess_status(String file, String save) {
        try {
            String[] regex = {"http(s)?://[^\\s]*", "\\d{3}-\\d{8}|\\d{4}-\\{7,8}", "\\d{11}"};
            String[] newString = {"", "", ""};
            String content = CommonTools.fileReader.readContent(file);
            Map<String,String> conver = buildMap();
            String[] regex_ = {"(辽宁|吉林|黑龙江).+\n", "(河北|山西|内蒙古|北京|天津).+\n", "(山东|江苏|安徽|浙江|台湾|福建|江西|上海).+\n", "(河南|湖北|湖南).+\n", "(广东|广西|海南|香港|澳门).+\n", "(云南|重庆|贵州|四川|西藏).+\n", "(新疆|陕西|宁夏|青海|甘肃).+\n", "((海外|None).+\n)|((海外|None).+)"};
            String[] newString_ = {"东北\n", "华北\n", "华东\n", "华中\n", "华南\n", "西南\n", "西北\n", "境外\n"};

            for (int i = 0; i < regex.length; i++) {
                content = content.replaceAll(regex[i], newString[i]);
                for(String string : conver.keySet()){
                    content = content.replace(string,conver.get(string));

                }
                for (int j= 0; j < regex.length; j++) {
                    content = content.replaceAll(regex_[j], newString_[j]);
                }
            }


            String [] tmp = content.split("\n");
            StringBuffer stringBuffer = new StringBuffer();
            for(int i=0;i< tmp.length;i++){
                String [] tt = tmp[i].split(",");
                stringBuffer.append(tt[0]+",");
                stringBuffer.append(tt[1]+",");
                String age="";
                if(Integer.parseInt(tt[2]) > 1990){
                    age = "c";
                }else if(Integer.parseInt(tt[2]) < 1980){
                    age = "a";
                }else{
                    age ="b";
                }
                stringBuffer.append(age+",");
                stringBuffer.append(tt[3]);
                stringBuffer.append("\n");
            }
            CommonTools.fileReader.write(save, content, "utf-8", false);
        } catch (IOException e) {
            // TODO Auto-generated catch block
            e.printStackTrace();
        }
    }

    public void preprocess_label_status(String status, String label, String saveStatus, String saveLabel) {
        preprocess_label(label, saveLabel);
        preprocess_status(status, saveStatus);
    }

    public Table combineLableAndStatus(String labelfile, String statusfile, String savefile) {
        String[] title1 = {"id", "retweet count", "comment count", "source", "time", "content"};
        String[] title2 = {"id", "gender", "age", "location"};

        Table table = new Table(statusfile, charset, ",", title1);
//        System.out.println(table.printTitleAndLine(10));
        Table table1 = new Table(labelfile, charset, "\\|\\|", title2);
        Table result = table.leftJoin(table, table1, 0, 0);
//        System.out.println(result.printTitleAndLine(10));
        result.saveTable(savefile, charset);
        return result;
    }

    public Map<String,Double> filter(Map<String,Double> map){
        Map<String, Double> map_ = new HashMap<String, Double>();
        for(String string: map.keySet()){
            if(locations.contains(string)){
                map_.put(string,map.get(string));
            }
        }
        return map_;
    }

    public Map<String, Double> calculateTfidf(Table result, String savefile,int minTf, int numrate) {
//        Table result = new Table(file1, charset, ",");
        System.out.println("calculating");
        Map<String, List<String[]>> map = result.buildMap(result.titleMap.get("location"), result.titleMap.get("content"), " ");
        List<String[]> tmp = result.converMap2List(map);
        tfidf.tfidf(tmp);
        tfidf.getTf();
        tfidf.getIdf();
        tfidf.getWordBag();
        System.out.println("tfidf complete");
        Map<String, Double> map_ = tfidf.tfidfFilterFirstN(minTf, numrate);
        String tfidfinfo = tfidf.tfidfToString(map_);
//        System.out.println(tfidfinfo);
        try {
            CommonTools.fileReader.write(savefile, tfidfinfo, "utf-8", false);
        } catch (IOException e) {
            // TODO Auto-generated catch block
            e.printStackTrace();
        }
        return map_;
    }

    public String makeArffFileWithTfidf(Table table, Map<String, Double> tfidf, String[] title, String saveFile) {
        String seperator = ",";
//        Table table = new Table(file, charset, seperator);
        if (title == null) {
            title = table.getTableTitle();
        }
        StringBuffer stringBuffer = new StringBuffer();
        String titleString = CommonTools.arrayToString(title, seperator);
        StringBuffer replaceString = new StringBuffer();
        for (int i = 0; i < tfidf.size(); i++) {
            replaceString.append("att" + i + seperator);
        }
        titleString = titleString.replace("content,", replaceString.toString());
        stringBuffer.append(titleString+"\n");

//        System.out.println(stringBuffer.toString());
        System.out.println(table.getTableContent().size());

        for (String[] tmp : table.getTableContent()) {
            for (int i = 0; i < title.length - 1; i++) {
                String string = title[i];
                if (!string.equals("content"))
                    stringBuffer.append(tmp[table.titleMap.get(string)] + seperator);
                else {
//                    String[] words = string.split(" ");
                    for (String word : tfidf.keySet()) {
                        if (tmp[i].contains(word)) {
                            stringBuffer.append(tfidf.get(word) + seperator);
                        } else {
                            stringBuffer.append("0,");
                        }
                    }
                }
            }
            stringBuffer.append(tmp[table.titleMap.get(title[title.length - 1])] + "\n");
        }
        try {
            CommonTools.fileReader.write(saveFile+".csv", stringBuffer.toString(), charset, false);
//            Csv2Arff.csv2arff(saveFile+".txt",saveFile+".arff");
        } catch (IOException e) {
            e.printStackTrace();
        }
        return stringBuffer.toString();
    }

    static Map<String, Double> tfidf_map = new HashMap<String, Double>();

    public static void train() {
        Preprocess preprocess = new Preprocess();
        String fileRoot = "G:\\Czb\\smpCup\\train\\";
        fileRoot = "E:\\BaiduYunDownload\\train\\train\\";
        String file1 = fileRoot + "train_status.txt";
        String file2 = fileRoot + "train_labels.txt";
        String save_label = fileRoot + "train_labels_filter.txt";
        String save_status = fileRoot + "train_status_filter.txt";
        preprocess.preprocess_label_status(file1, file2, save_status, save_label);
//
        String resultsave = fileRoot + "train_labels_status.txt";
        Table result = preprocess.combineLableAndStatus(save_label, save_status, resultsave);



        String tfidfFile = fileRoot + "tfidf_info_label_status.txt";
        tfidf_map = preprocess.calculateTfidf(result, tfidfFile,0,0);
        System.out.println(tfidf_map.size());
        tfidf_map = preprocess.filter(tfidf_map);
        System.out.println(tfidf_map.size());
        String tmp = fileRoot +"tfidf.txt";

        try {
            CommonTools.fileReader.write(tmp,CommonTools.tfidfToString(tfidf_map),"utf-8", false);
        } catch (IOException e) {
            e.printStackTrace();
        }

        Map<String, String[]> map2 = result.buildMap(result.titleMap.get("id"), result.titleMap.get("content"));
        List<String[]> tmp11 = result.converMap2List_(map2);
        Table table = new Table();
        table.setTableTitle(result.getTableTitle());
        table.setTableContent(tmp11);
        String arffFile_train = fileRoot + "arffTrain_tfidf_label_status";
        preprocess.makeArffFileWithTfidf(table, tfidf_map, null, arffFile_train);
    }

    public static void test() {
        Preprocess preprocess = new Preprocess();
        String fileRoot = "G:\\Czb\\smpCup\\test\\";
        fileRoot = "E:\\BaiduYunDownload\\test\\test\\";
        String file1 = fileRoot + "test_status.txt";
        String file2 = fileRoot + "test_labels.txt";
        String save_label = fileRoot + "test_labels_filter.txt";
        String save_status = fileRoot + "test_status_filter.txt";
        preprocess.preprocess_label_status(file1, file2, save_status, save_label);

        String resultsave = fileRoot + "test_labels_status.txt";
        Table result = preprocess.combineLableAndStatus(save_label,save_status, resultsave);

        System.out.println(result.getTableContent().size());
//        String tfidfFile = fileRoot+"tfidf_info_label_status.txt";
//        Map<String,Double> tfidf = preprocess.calculateTfidf(resultsave,tfidfFile);

        Map<String, String[]> map2 = result.buildMap(result.titleMap.get("id"), result.titleMap.get("content"));

        List<String[]> tmp11 = result.converMap2List_(map2);
        Table table = new Table();
        table.setTableTitle(result.getTableTitle());
        table.setTableContent(tmp11);


        String arffFile_train = fileRoot + "arfftest_tfidf_label_status";
        preprocess.makeArffFileWithTfidf(table, tfidf_map, null, arffFile_train);
    }


    public static void main(String[] args) {

        train();
        System.out.println("train complete");
        test();
        System.out.println("test complete");
    }


}
